"""
算法实现原理
1. 随意选择两个大的质数 p 和 q, p 不等于 q, 计算 N = pq
2. 根据欧拉函数，求得φ(N)=φ§φ(q)=(p-1)(q-1)。这是一个公式如果N = pq，那么φ(N)=φ(p)φ(q)，又因为p和q都是素数，φ(p) = p-1，所以φ(N)=φ(p)φ(q)=(p-1)(q-1)
3. 选择一个数e,使e大于1，并且e小于φ(N)，找一个数d,使得 ed = 1(mod φ(N)),即存在k,满足 ed = kφ(N)+1, k>=1;
4. (e,n)为公钥， （d,e)为私钥
5. 加密：m^e = c(mod n), 其中 C为密文,m为明文
6. 解密: c^d = m(mod n)
7. 费马小定理提出：如果p是一个质数，而整数a不是p的倍数，则有a^(p-1)≡1(mod p)。
8. 欧拉定理表明 若n,a为正整数，且n,a 互质，则有a^(φ(n))≡1(mod n)。
9. 由 7，8 可得 （a^φ(N)）%n =1
"""
# simple test
p = 17
q = 19
n = p * q
print(n)
f_n = (p-1)*(q-1)   # 288
print(f_n)
# 随机取一数e, 使得 1 < e < f_n, 并且 e 和 f_n 互质， 这里取 e = 5
e = 5

# 找一个数 d, 使得 ed = 1(mod f_n), ed = K*f_n +1, K >=1;
d = 173  # 满足 e*d = f_n * 3 +1

# 公钥为(5,323) , 私钥为115

# 明文 m = 123
m = 123
c = (m**e) % n
print("加密后数据为：", c)
dec = (c**d) % n
print("解密后数据为：", dec)













